/**

Задание 7

Сформировать запрос для получения числа на ФКТИУ троечников.

*/

select count(*) from (
  select Н_ЛЮДИ.ИД
  from Н_ЛЮДИ
  join Н_ОБУЧЕНИЯ on Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
  join Н_УЧЕНИКИ on Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
  join Н_ПЛАНЫ on Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
  join Н_ОТДЕЛЫ on Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ОТД_ИД
  join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
  where Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ' 
    and Н_ВЕДОМОСТИ.ОЦЕНКА in ('1', '2', '3', '4', '5')
  group by Н_ЛЮДИ.ИД
  having min(Н_ВЕДОМОСТИ.ОЦЕНКА::int) = 3
) as ТРОЕЧНИКИ_НА_ФКТИУ;
